# InitialIntensityValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InitialIntensity..::..InitialIntensityValue Property
InitialIntensity Class See Also
---
The calculated initial intensity value.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double InitialIntensityValue { get; }
```

Visual Basic
---
```text
Public ReadOnly Property InitialIntensityValue As Double
	Get
```

Visual C++
---
```text
public:
property double InitialIntensityValue {
	double get ();
}
```

# See Also
InitialIntensity Class
Autodesk.Revit.DB.Lighting Namespace